



#-------------------------------------------------------------------------------------------------------



#-------------------------------------------------------------------------------------------------------

function DSRTA(dχ::Matrix,χ,t::Float64,p)

    # p = (N,L,η₀,κ₀,nₐᵣ,nₙ,nₑ)
    nₐᵣ = p[1]
    nₙ  = p[2]
    nₑ  = p[3]
    ζ₀  = p[4]
    uᵣ⁰ = p[5]
  

    α = χ[nₙ,L+1]       # μ/T
    h = χ[nₑ,L+1]       # ln(τ₀T)
    u = χ[nₑ+1,L+1]     # τ/τ₀
    

    T   = exp(h) 
    uᵣ  = uᵣ⁰/T         # τᵣ/τ_₀ = η₀/(τ_₀T)
    #print(T)
    if ζ₀ == 0
        ζ   = 0
    else
        ζ   = ζ₀/T      # m/T, (m/T₀)*(T₀/T) = 
    end
    

    w = uᵣ/u
    

    G30 = Gnl(3.0,0,ζ)
    G40 = Gnl(4.0,0,ζ)
    G41 = Gnl(4.0,1.0,ζ)
    G50 = Gnl(5.0,0,ζ)
    
    
    Gd = G40^2 - G30*G50
    

    for (n,nᵥ) in enumerate(nₐᵣ)        
        #--------------------------------------------------------------------------
        for l = 1:L+1           
            #--------------------------------------------------------------------------

            # Here for lmax = L-1 we put the truncation condition.
            if l < L           
                g = (1/3)*( (( Gnl(ζ,nᵥ + 4.0,l-1)*G30 -  G40*Gnl(ζ,nᵥ + 3.0,l-1) )/(Gd))*(G41/Gnl(ζ,nᵥ + 3.0,l-1))*(χ[nₑ,2]* χ[n,l])  +  3*(nᵥ-2(l-1))*((2*(l-1) +1.0)/(2*(l-1) +3.0))*( Gnl(ζ,nᵥ + 3.0,l)/Gnl(ζ,nᵥ + 3.0,l-1) )* χ[n,l+1] )
                
                f = (2*(l-1))*χ[n,l] 
                r = ( χ[n,l] - 1 )

                dχ[n,l] = -( g +  f)*(w)  - ( r )  
            elseif l == L
                g = (1/3)*( (( Gnl(ζ,nᵥ + 4,l-1)*G30 -  G40*Gnl(ζ,nᵥ + 3,l-1) )/(Gd))*(G41/Gnl(ζ,nᵥ + 3,l-1))*(χ[nₑ,2]* χ[n,l])  +  3* (nᵥ-2(l-1)) *( (2*(l-1) +1)/(2*(l-1) +3) )*( Gnl(ζ,nᵥ + 3.0,l)/Gnl(ζ,nᵥ + 3.0,l-1) )* 1 )
                
                f = (2*(l-1))*χ[n,l] 
                r = ( χ[n,l] - 1 )

                dχ[n,l] = -( g +  f)*(w)  - ( r )   
            else
                dχ[n,L+1] = 0  
            end         
        end
                
    end
    dχ[nₑ,L+1] = ( G41*G30/Gd)*χ[nₑ,2]*(w/3)  # h ~ τ₀T
    
    dχ[nₙ,L+1] = -( (G41*G40)/Gd)*(χ[nₑ,2]*(w/3))- (w)

    #println("dχ[nₑ,L+1]     :",dχ[nₑ,L+1] )
    dχ[nₑ+1,L+1] = uᵣ

    return dχ
end